---
type: DocumentPreviewSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# DocumentPreviewSettings

`Autodesk.Revit.DB.DocumentPreviewSettings` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | ForceViewUpdate | 2012 | `public void ForceViewUpdate ( bool forceViewUpdate )` |
| Method | IsViewIdValidForPreview | 2012 | `public bool IsViewIdValidForPreview ( ElementId viewId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | IsViewUpdateForced | 2012 | `public bool IsViewUpdateForced { get ; }` |
| Property | PreviewViewId | 2012 | `public ElementId PreviewViewId { get ; set ; }` |